{"pageProps":{"post":{"attributes":{"description":""},"html":"<p>We didn&#39;t cover quite everything that React offers in terms of hooks. I tried to keep it to things that I think you will use on a regular basis and leave the extra-special cased ones for you learn on a need-to-know basis. These ones I have <em>never had to use professionally</em> and I imagine many of you will be in my boat. However I am going to list them out here for you.</p>\n<h2 id=\"useimperativehandle\">useImperativeHandle</h2>\n<p>Imagine you make a super fancy input component as part of your design system. Imagine that a <em>parent element</em> (i.e. the component that renders the fancy input) that needs to call <code>focus()</code> on the fancy input because of a validation error.</p>\n<p>This is what <code>useImperativeHandle</code> is for. It allows a child component to expose a method (I used focus as an example but could be anything). You pass in a ref from <code>useRef</code> to the child component, it uses that ref to pass back methods to the parent. If you make libraries or design systems, this is useful. Otherwise there are easier ways to do this.</p>\n<h2 id=\"usedebugvalue\">useDebugValue</h2>\n<p>This is useful for people make custom hooks (like <a href=\"/lessons/core-react-concepts/custom-hooks\">we did in the Complete Intro to React</a>). If you want your hook to expose a custom debugging value to the React Dev Tools, useDebugValue allows you to do this. I still haven&#39;t a good reason to do this so I don&#39;t teach it anymore.</p>\n<h2 id=\"usedeferredvalue\">useDeferredValue</h2>\n<p>This one and <code>useTransition</code> center around low priority updates. A good example of these is type-ahead suggestions. Type-ahead is not super important, and often a user is typing fast enough that lots of suggestions are getting thrown away as they type. It therefore is a low priority UI update and we should not lock up the entire UI trying to render low priority work.</p>\n<p>This is what <code>useDeferredValue</code> allows you to do. It allows you identify data which would cause a re-render as &quot;this can be interrupted, if you have something else happen while this is trying to compute, do that other stuff first and then come back to this.&quot;</p>\n<p>This requires a lot of cognitive burden to wrap your mind around the &quot;what&quot; and &quot;when&quot; of your app and so I never find myself reaching for it.</p>\n<h2 id=\"usetransition\">useTransition</h2>\n<p>Likewise to <code>useDeferredValue</code>, it allows you to set up &quot;low priority&quot; updates. <code>useTransition</code> gives you back a function to start a transition that can be interrupted if something higher priority comes up, like a user clicking somewhere. After you start that transition, it will give you back a boolean <code>isCurrentlyTransitioning</code> flag that will allow you to show a spinner while this transition is being delayed. Once React has cleared everything out and gotten to the low priority transition, everything will settle into a normal state.</p>\n<p>Like above, this creates some indirection in how your app renders and I don&#39;t choose to use this very frequently. If you have some low priority things to render at the bottom of your page that are expensive to render (think like a comment section at the bottom of an article) then this would be a good case to use that. But for now I&#39;d advise not using these until you really, truly have a problem that these tools are a fit for. These were built for Facebook problems and most of us don&#39;t have Facebook problems.</p>\n<h2 id=\"usesyncexternalstore\">useSyncExternalStore</h2>\n<p>This hook was made to sync with external libraries (like Redux, Mobx, etc.) Even the React docs say this isn&#39;t really made for app devs but mostly for library devs.</p>\n<h2 id=\"useinsertioneffect\">useInsertionEffect</h2>\n<p>Like above, this hook was made for use with libraries. In this case, an insertion effect occurs <em>before</em> rendering (as opposed to effect and layout effect which both happen <em>just after</em> rendering.) Because of this, it&#39;s more limited in what it can access (e.g. it can&#39;t use refs.)</p>\n<p>Mostly insertion effects are for CSS-in-JS libraries like Emotion and styled-components. You as an app dev should not really have a use for it.</p>\n","slug":"others","title":"Others","section":"Hooks in Depth","icon":"search","filePath":"/home/runner/work/complete-intro-to-react-v8/complete-intro-to-react-v8/lessons/09-hooks-in-depth/G-others.md","nextSlug":"/lessons/tailwindcss/css-and-react","prevSlug":"/lessons/hooks-in-depth/useid"}},"__N_SSG":true}