{"pageProps":{"post":{"attributes":{"title":"useLayoutEffect","description":""},"html":"<h3 id=\"link-directly-to-stackblitz\"><a href=\"https://stackblitz.com/edit/ir5?view=both&amp;file=src/routes/UseLayoutEffect.jsx&amp;hideExplorer=1&amp;initialPath=/useLayoutEffect\">Link directly to StackBlitz</a></h3>\n<iframe src=\"https://stackblitz.com/edit/ir5?embed=1&view=both&file=src/routes/UseLayoutEffect.jsx&hideExplorer=1&initialPath=/useLayoutEffect\"></iframe>\n\n<p><code>useLayoutEffect</code> is almost the same as <code>useEffect</code> except that it&#39;s synchronous to render as opposed to scheduled like <code>useEffect</code> is. If you&#39;re migrating from a class component to a hooks-using function component, this can be helpful too because <code>useLayoutEffect</code> runs at the same time as <code>componentDidMount</code> and <code>componentDidUpdate</code> whereas <code>useEffect</code> is scheduled after. This should be a temporary fix.</p>\n<p>The only time you <em>should</em> be using <code>useLayoutEffect</code> is to measure DOM nodes for things like animations. In the example, I measure the textarea after every time you click on it (the onClick is to force a re-render.) This means you&#39;re running render twice but it&#39;s also necessary to be able to capture the correct measurments.</p>\n<p>If you make the <code>useLayoutEffect</code> into a <code>useEffect</code> it will have a janky re-render where it&#39;ll flash before it renders correctly. This is exactly why we need <code>useLayoutEffect</code>.</p>\n<blockquote>\n<p>Note if you drag &quot;off&quot; the textarea and let go of the mouse it won&#39;t measure the textarea. This is because when you click and hold something and then drag off of it, it doesn&#39;t trigger a click event. That makes sense, right? When you click something by mistake, what do you do? You drag off of it and let go. Same princple here.</p>\n</blockquote>\n","slug":"uselayouteffect","title":"useLayoutEffect","section":"Hooks in Depth","icon":"search","filePath":"/home/runner/work/complete-intro-to-react-v8/complete-intro-to-react-v8/lessons/09-hooks-in-depth/E-uselayouteffect.md","nextSlug":"/lessons/hooks-in-depth/useid","prevSlug":"/lessons/hooks-in-depth/usecallback"}},"__N_SSG":true}