{"pageProps":{"post":{"attributes":{"description":"Brian talks about his favorite JS tool, Prettier, a tool that that helps you maintain consistent code style with no work on the dev's part."},"html":"<h2 id=\"code-quality\">Code Quality</h2>\n<p>It&#39;s important to keep quality high when writing code. Or at least that&#39;s how I sell ESLint and Prettier to my co-workers. In reality I&#39;m super lazy and want the machine to do as much work as possible so I can focus more on architecture and problem-solving and less on syntax and style. While there are many tools that can help you keep code quality high, these two I consider core to my workflow.</p>\n<p><a href=\"https://github.com/prettier/prettier\">Prettier</a> is an amazing tool from the brain of <a href=\"https://twitter.com/jlongster\">James Long</a>. James, like many of us, was sick of having to constantly worry about the style of his code: where to stick indents, how many, when to break lines, etc etc. Coming from languages like Go, Reason, or Elm where all that is just taken care of by the tooling for the language, this quickly wears. James did something about it and made a tool to take care of it: Prettier.</p>\n<p>Prettier is a really fancy pretty printer. It takes the code you write, breaks it down in to an abstract syntax tree (AST) which is just a representation of your code. It then takes that AST, throws away all of your code style you made and prints it back out using a predefined style. While this sounds a little scary, it&#39;s actually really cool. Since you no longer have control of the style of your code, you no longer have to think about it at all. Your code is always consistent, as is the code from the rest of your team. No more bikeshedding!! As I like to put it: if your brain is a processor, you get to free up the thread of your brain that worries about code styles and readability: it just happens for you. Don&#39;t like semicolons? Don&#39;t write them! It puts them in for you. I <em>love</em> Prettier.</p>\n<p>Need to tool around a bit with it before you trust it? <a href=\"https://prettier.io/playground/\">Go here</a>. You can see how it works.</p>\n<p>Let&#39;s go integrate this into our project. It&#39;s <em>pretty</em> easy (since I&#39;m a dad now, I&#39;m legally obligated to make this joke.)</p>\n<p>Either install Prettier globally <code>npm install --global prettier</code> or replace when I run <code>prettier</code> with (from the root of your project) <code>npx prettier</code>. From there, run <code>prettier src/App.js</code>. This will output the formatted version of your file. If you want to actually write the file, run <code>prettier --write src/App.js</code>. Go check src/App.js and see it has been reformatted a bit. I will say for non-JSX React, prettier makes your code less readable. Luckily Prettier supports JSX! We&#39;ll get to that shortly.</p>\n<p>Prettier has a few configurations but it&#39;s mostly meant to be a tool everyone uses and doesn&#39;t argue/bikeshed about the various code style rules. <a href=\"https://prettier.io/docs/en/options.html\">Here they are</a>. I just use it as is since I&#39;m lazy. Prettier can also understand <a href=\"https://flow.org/\">flow</a> and <a href=\"https://www.typescriptlang.org/\">TypeScript</a>.</p>\n<p>Prettier is great to use with <a href=\"https://code.visualstudio.com/?WT.mc_id=reactintro-github-brholt\">Visual Studio Code</a>. Just download <a href=\"https://marketplace.visualstudio.com/items?itemName=esbenp.prettier-vscode&amp;WT.mc_id=reactintro-github-brholt\">this extension</a>. Pro tip: set it to only run Prettier when it detects a Prettier config file. Makes it so you never have to turn it off. In order to do that, set <code>prettier.requireConfig</code> to <code>true</code> and <code>editor.formatOnSave</code> to true.</p>\n<p>So that our tool can know this is a Prettier project, we&#39;re going to create a file called <code>.prettierrc</code> and put <code>{}</code> in it. This lets everyone know this is a Prettier project that uses the default configuration. You can put other configs here if you hold strong formatting opinions.</p>\n<h2 id=\"npmyarn-scripts\">npm/Yarn scripts</h2>\n<p>So it can be painful to try to remember the various CLI commands to run on your project. You can put CLI commands into it and then run the name of the tag and it&#39;ll run that script. Let&#39;s go see how that works. Put the following into your package.json.</p>\n<p>First run <code>npm install -D prettier@2.7.1</code>. <code>-D</code> means it&#39;s for development only.</p>\n<pre><code class=\"hljs language-json\"><span class=\"hljs-attr\">&quot;scripts&quot;</span><span class=\"hljs-punctuation\">:</span> <span class=\"hljs-punctuation\">{</span>\n    <span class=\"hljs-attr\">&quot;format&quot;</span><span class=\"hljs-punctuation\">:</span> <span class=\"hljs-string\">&quot;prettier --write \\&quot;src/**/*.{js,jsx}\\&quot;&quot;</span>\n<span class=\"hljs-punctuation\">}</span><span class=\"hljs-punctuation\">,</span>\n</code></pre>\n<p>Now you can run <code>yarn format</code> or <code>npm run format</code> and it will run that command. This means we don&#39;t have to remember that mess of a command and just have to remember format. Nice, right? We&#39;ll be leaning on this a lot during this course.</p>\n<blockquote>\n<p>Note the the <code>@2.7.1</code> portion. For the purposes of making this course not break in the future, I have you install the <em>exact</em> version of packages I used when I made this course. As is natural, packages change and progress over time and I can&#39;t anticipate how that will happen. So I&#39;d suggest you use the same packages I do as you do this course (even if npm yells at you for security vulnerabilites). As soon as you&#39;re done with the course, feel free to go update the versions to the latest and see if anything breaks.</p>\n</blockquote>\n","slug":"prettier","title":"Prettier","section":"JS Tools","icon":"hammer","filePath":"/home/runner/work/complete-intro-to-react-v8/complete-intro-to-react-v8/lessons/03-js-tools/B-prettier.md","nextSlug":"/lessons/js-tools/eslint","prevSlug":"/lessons/js-tools/npm"}},"__N_SSG":true}